app/controllers/problems_controller.rb

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def create
    @problem = Problem.new(problem_params)

    respond_to do |format|
      if @problem.save
---
INSERT INTO "problems" ("description", "category", "solution", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @problem.destroy
---
DELETE FROM "problems" WHERE "problems"."id" = ?  [["id", 1]]

    def set_problem
      @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]